{
  "page_title": "Résumé",
  "page_subTitle": "An Awesome person :)",
  "donwloadResume": "Download Awesome Resume",
  "resumeFilePath": "../../assets/Pdf/Harshal_Raverkar_AVP-SSE_8Years.pdf",
  "gitlabFilePath": "../../assets/JsonData/Gitlab.json",
  "azureFilePath": "../../assets/JsonData/Azure_DevOps_REST_API_v7.3.json",
  "workExperience": "Work Experience",
  "previousExperience": "Previous Experience",
  "skills": "Skills",
  "programmingSkills": "Programming Language / Databases",
  "gisSkills": "GIS Packages / API Development",
  "project": "Project",
  "education": "Education",
  "currentCompany": [
    {
      "companyName": "Swiss Re",
      "location": "Hyderabad, India",
      "workInformation": "As a dedicated DevSecOps Engineer, I focus on bridging the gap between development, operations, and security to ensure robust and efficient solutions. I assist teams with auditing processes, implementing security best practices, and identifying vulnerabilities to maintain compliance and protect critical systems. My expertise extends to designing and executing secure CI/CD pipelines, automating security processes, and delivering scalable, secure solutions that enhance operational efficiency. With a proactive approach to problem-solving."   },
    {
      "companyName": "Deloitte USI (Deloitte Tax India Pvt. Ltd.)",
      "location": "Hyderabad, India",
      "workInformation": null
    },
    {
      "companyName": "Sutherland Healthcare Services Pvt. Ltd.",
      "location": "Bengaluru, India",
      "workInformation": null
    },
    {
      "companyName": "GeoOpsis Software Services - (AEVEX Aerospace USA)",
      "location": "Bengaluru, India",
      "workInformation": null
    },
    {
      "companyName": "BOP Philips Manipal",
      "location": "Manipal, India",
      "workInformation": null
    }
  ],

  "devSkillsName": [
    {
      "skillName": "C# (.NET Core)"
    },
    {
      "skillName": "Angular"
    },
    {
      "skillName": "JavaScript"
    },
    {
      "skillName": "NodeJS"
    },
    {
      "skillName": "TypeScript"
    },
    {
      "skillName": "WPF"
    },
    {
      "skillName": "MSSQL"
    },
    {
      "skillName": "PostGreSQL"
    }
  ],
  "gisSkillsName": [
    {
      "skillName": "Azure DevOps"
    },
    {
      "skillName": "Luciad Developer"
    },
    {
      "skillName": "Open Layers Maps"
    },
    {
      "skillName": "Google Maps"
    },
    {
      "skillName": "CesiumJS"
    },
    {
      "skillName": "Git / Github"
    },
    {
      "skillName": "Rest API Development"
    },
    {
      "skillName": "Visual Studio"
    }
  ],
  "projectDetails": [
    {
      "projectName": "CT Automation - Mercury",
      "tech_Used": [
        " C#(.Net) ",
        " Azure ",
        " Angular ",
        " MSSQL ",
        " MongoDB "
      ],
      "client_name": "Deloitte UK Internal",
      "project_Description": "Mercury is meticulously crafted to streamline and automate the Corporate Tax compliance journey by seamlessly integrating with kortical's APIs. Our software effortlessly handles the reception of raw client data, structures it efficiently, extracts comprehensive trial balance records, and seamlessly transmits the computed information for tax filing. Powered by the OneSource Software, our solution ensures a smooth and efficient corporate tax compliance process. With Mercury, we have successfully onboarded over 2000 corporate clients and facilitated numerous filings, demonstrating our commitment to providing a robust and efficient solution for corporate tax compliance."
    },
    {
      "projectName": "EFiling - Filing Approval",
      "tech_Used": [
        " C#(.Net) ",
        " Azure ",
        " Angular ",
        " MSSQL ",
        " MongoDB "
      ],
      "client_name": "Deloitte UK Internal",
      "project_Description": "The eFiling project has been developed utilizing Angular as the front-end technology and Dotnet Core as the back-end technology. This platform serves as a crucial tool for approving various client computation requests, ensuring tax compliance. eFiling streamlines the process of handling and approving these requests, contributing to a more efficient and effective tax management system."
    },
    {
      "projectName": "GeoFocis Desktop & GeoFocis Web",
      "tech_Used": [
        " C#(.Net) ",
        " WPF ",
        " MVVM ",
        " Angular ",
        " MSSQL ",
        " MongoDB ",
        " Java ",
        " NodeJS ",
        " PostGreSQL ",
        " JavaScript ",
        " Cesium-JS "
      ],
      "client_name": "United State Forest Service",
      "project_Description": "GeoFOCIS establishes a centralized and accessible web-based server designed to host and integrate platform information seamlessly with incidents and real-time products, leveraging portable mapping software, specifically Luciad. The GeoFOCIS product serves as a critical tool for Intelligence, Surveillance, and Reconnaissance (ISR) data, facilitating the analysis of real-time incident and fire data.The platform offers a versatile set of tools, empowering users to draw points, polygons, and polylines directly on the map. Additionally, it supports the incorporation of various raster and vector layers, allowing for customization and styling of layer data within the GeoFOCIS interface. Users can create shape-files, KML, and KMZ files, exporting them with the associated styling data layer. Furthermore, GeoFOCIS provides overlay tools that enable users to compare different vector layer datasets, enhancing the platform's capabilities for comprehensive spatial analysis."
    },
    {
      "projectName": "INTELLINEWS",
      "tech_Used": [
        " NodeJS ",
        " Angular ",
        " PostGreSQL ",
        " MongoDB ",
        " Google Maps API "
      ],
      "client_name": "AEVEX Aerospace (USA) - Internal",
      "project_Description": "IntelliNews stands as an innovative online map application, revolutionizing the way users engage with real-time news. This dynamic platform empowers users to precisely define their Region Of Interest (ROI), enabling them to curate a personalized and relevant news feed. By selecting specific geographical areas on the map, users can receive live news articles delivered seamlessly to their Facebook and Twitter accounts. This interactive approach not only enhances user experience but also provides a comprehensive and localized perspective on unfolding events. Whether it's staying informed about global happenings or focusing on news that directly impacts a chosen region, IntelliNews offers a tailored and connected experience for users seeking the latest updates."
    },
    {
      "projectName": "SOIS Portal",
      "tech_Used": [" C#(.Net) ", " ASP Net ", " MSSQL "],
      "client_name": "Manipal University",
      "project_Description": "Handled the internal project of Manipal University. Worked on SoIS Portal, Placement Assistant tools and internship project tracker to handle the placement activity, internship & final presentation information of student automated by this tool."
    }
  ],
  "schoolDetails": [
    {
      "schoolName": "Manipal Institute of Technology, Manipal",
      "schoolLocation": "Manipal, India",
      "schoolCourse": "Master of Science Technology in Computing Technology & Virtualization"
    },
    {
      "schoolName": "Rajiv Gandhi Produyogiki Vishwavidhalaya, Indore",
      "schoolLocation": "Indore, India",
      "schoolCourse": "Bachelor of Engineering in Computer Science & Engineering"
    }
  ]
}
